{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Much of the information we are gathering in the iSAID exercise has either unverified or uncertain relationships to named entities that can be linked to a source of definition and meaning or it consists of unstructured chunks of text that have to be processed with some form of natural language processing if we want to identify characteristics of the entities being described for analysis. To accomplish these tasks, we are pursuing a combination of rule-based named entity recognition (NER) with machine learning NER. The former is a fairly simplistic process of  finding a named entity within a piece of text, while the latter uses statistical methods with a trained model to identify etities based on where and how they show up in text. Machine learning helps us identify concepts that we don't explicitly start with as known entities. We are combining these approaches together in experimentation toward entity linking machine learning where our goal is to characterize entities in our knowledge graph with links to other defined entities in our graph.\n",
    "\n",
    "We are still in early phases of this development, examining several different technologies and methods for best results that we can take into an operational system. In this notebook, we are simply teeing up one example of a training dataset for processing with the Python Spacy NLP package. We build a full corpus of potentially relevant texts that we've already assembled in our graph tied to specific entities (people, projects, datasets, etc.) and run a simple rule-based process to identify where these terms show up in our texts. We then dump this and process it via command line to train a very specific NER model that we can operate against these and other texts to identify potential entity relationships. We can then confirm those entity relationships against our reference vocabulary and feed what we want to use as relationships into the graph.\n",
    "\n",
    "We are also experimenting with more robust ways of accomplishing this same task, with the most promising being the development of an actual knowledge graph model witin Spacy and developing word vector training data using Gensim to build entity linking models. Early results to simply jumpstart the process with this fairly crude method using the small Climate Change Glossary has let us show the potential of the overall NER approach. We are also examining the Amazon Web Services approach to NER using their built-in specific technologies. Those could offer some operational advantages as our raw materials will be spun up in other parts of the AWS stack. However, we would like to maintain a certain separation of concerns in the architecture such that key steps like training data selection and processing, training data versioning, model building parameters, individual model-building runs, and entity-linking steps can all be individually maintained and operated in a way that will stand the test of time."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import isaid_helpers\n",
    "import pickle\n",
    "from collections import Counter\n",
    "import ast\n",
    "import re\n",
    "import multiprocessing\n",
    "from joblib import Parallel, delayed\n",
    "from tqdm import tqdm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Counter({'Wikidata Mineral Species': 10314,\n",
       "         'Wikidata Chemical Elements': 667,\n",
       "         'Wikidata Sedimentary Rocks': 91,\n",
       "         'Wikidata Clastic Sediments': 7,\n",
       "         'Wikidata Sovereign States': 1409,\n",
       "         'Wikidata US States': 50,\n",
       "         'Wikidata Global Seas and Oceans': 258,\n",
       "         'Wikidata Global Faults': 3102,\n",
       "         'Wikidata Global Volcanos': 1548,\n",
       "         'Wikidata Global Earthquakes': 1500,\n",
       "         'Wikidata US National Parks': 106,\n",
       "         'Wikidata US National Monuments': 184,\n",
       "         'Wikidata US National Forests': 221,\n",
       "         'Wikidata US Wild and Scenic Rivers': 50,\n",
       "         'Wikidata Geologic Formations': 9299,\n",
       "         'Wikidata Aquifers': 27,\n",
       "         'Wikidata Fields of Science': 457,\n",
       "         'Wikidata Additional Commodities': 10,\n",
       "         'Wikidata US Territories': 38,\n",
       "         'Wikidata US Counties': 3108,\n",
       "         'EPA Climate Change Glossary': 123,\n",
       "         'Common geographic areas': 66096,\n",
       "         'USGS Thesaurus': 1151,\n",
       "         'Alexandria Digital Library Feature Type Thesaurus': 213,\n",
       "         'Lithologic classification of geologic map units': 207,\n",
       "         'Named instances': 21,\n",
       "         'ISO 19115 Topic Category': 20,\n",
       "         'Data Categories for Marine Planning': 91,\n",
       "         'Thesaurus categories': 30,\n",
       "         'USGS information products': 44,\n",
       "         'Metadata Standards': 11,\n",
       "         'Marine Realms Information Bank (MRIB) keywords': 763,\n",
       "         'Coastal and Marine Ecological Classification Standard': 829})"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "reference_vocabulary = pickle.load(open(isaid_helpers.f_ner_reference, \"rb\"))\n",
    "display(Counter(i['source'] for i in reference_vocabulary))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "projects 17119\n",
      "creative_works 20793\n",
      "datasets 21853\n",
      "undefined_terms 1524\n",
      "locations 1468\n",
      "job_titles 1954\n",
      "CPU times: user 2.85 s, sys: 321 ms, total: 3.17 s\n",
      "Wall time: 4.59 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "entity_collections = dict()\n",
    "\n",
    "with isaid_helpers.graph_driver.session(database=isaid_helpers.graphdb) as session:\n",
    "    results = session.run(\"\"\"\n",
    "    MATCH (pr:Project)\n",
    "    WHERE NOT pr.descriptive_texts IS NULL\n",
    "    RETURN pr.name AS name, pr.descriptive_texts AS descriptive_texts\n",
    "    \"\"\")\n",
    "    entity_collections[\"projects\"] = results.data()\n",
    "\n",
    "with isaid_helpers.graph_driver.session(database=isaid_helpers.graphdb) as session:\n",
    "    results = session.run(\"\"\"\n",
    "    MATCH (w:CreativeWork)\n",
    "    WHERE NOT w.description IS NULL\n",
    "    RETURN w.name AS name, w.description AS description\n",
    "    \"\"\")\n",
    "    entity_collections[\"creative_works\"] = results.data()\n",
    "\n",
    "with isaid_helpers.graph_driver.session(database=isaid_helpers.graphdb) as session:\n",
    "    results = session.run(\"\"\"\n",
    "    MATCH (d:Dataset)\n",
    "    WHERE NOT d.description IS NULL\n",
    "    RETURN d.name AS name, d.description AS description\n",
    "    \"\"\")\n",
    "    entity_collections[\"datasets\"] = results.data()\n",
    "\n",
    "with isaid_helpers.graph_driver.session(database=isaid_helpers.graphdb) as session:\n",
    "    results = session.run(\"\"\"\n",
    "    MATCH (t:UndefinedSubjectMatter)\n",
    "    RETURN t.name AS name, t.description AS description\n",
    "    \"\"\")\n",
    "    entity_collections[\"undefined_terms\"] = results.data()\n",
    "\n",
    "with isaid_helpers.graph_driver.session(database=isaid_helpers.graphdb) as session:\n",
    "    results = session.run(\"\"\"\n",
    "    MATCH (l:Location)\n",
    "    RETURN l.name AS name, l.description AS description\n",
    "    \"\"\")\n",
    "    entity_collections[\"locations\"] = results.data()\n",
    "\n",
    "with isaid_helpers.graph_driver.session(database=isaid_helpers.graphdb) as session:\n",
    "    results = session.run(\"\"\"\n",
    "    MATCH (jt:JobTitle)\n",
    "    RETURN jt.name AS name, jt.description AS description\n",
    "    \"\"\")\n",
    "    entity_collections[\"job_titles\"] = results.data()\n",
    "\n",
    "for item in entity_collections.keys():\n",
    "    print(item, len(entity_collections[item]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "UNIQUE TEXTS: 174470\n",
      "BAD TEXTS: 3\n"
     ]
    }
   ],
   "source": [
    "all_texts = list()\n",
    "bad_texts = list()\n",
    "\n",
    "for collection_name, collection_items in entity_collections.items():\n",
    "    for item in collection_items:\n",
    "        all_texts.append(item[\"name\"])\n",
    "        if \"description\" in item and item[\"description\"]:\n",
    "            all_texts.append(item[\"description\"])\n",
    "        if \"descriptive_texts\" in item and item[\"descriptive_texts\"]:\n",
    "            try:\n",
    "                descriptive_texts_list = ast.literal_eval(item[\"descriptive_texts\"])\n",
    "                if isinstance(descriptive_texts_list, list):\n",
    "                    all_texts.extend(descriptive_texts_list)\n",
    "                else:\n",
    "                    print(type(descriptive_texts_list))\n",
    "            except:\n",
    "                bad_texts.append(item[\"descriptive_texts\"])\n",
    "\n",
    "unique_texts = list()\n",
    "for text in list(set(all_texts)):\n",
    "    if not isinstance(text, str):\n",
    "        continue\n",
    "    if len(text) < 20:\n",
    "        continue\n",
    "    unique_texts.append(text)\n",
    "    \n",
    "pickle.dump(unique_texts, open(\"data/training_texts.p\", \"wb\"))\n",
    "print(\"UNIQUE TEXTS:\", len(unique_texts))\n",
    "print(\"BAD TEXTS:\", len(bad_texts))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "bad_refs = list()\n",
    "\n",
    "def train_data(text, references, reference_sources=None):\n",
    "    entities = list()\n",
    "    refs_found = list()\n",
    "    \n",
    "    if reference_sources is not None:\n",
    "        references = [i for i in references if i[\"source\"] in reference_sources]\n",
    "    \n",
    "    for ref in references:\n",
    "        if ref not in bad_refs:\n",
    "            start_positions = list()\n",
    "            try:\n",
    "                start_positions.extend([m.start() for m in re.finditer(ref[\"label\"], text)])\n",
    "            except Exception as e:\n",
    "                bad_refs.append(ref)\n",
    "                continue\n",
    "\n",
    "            if start_positions:\n",
    "                refs_found.append(ref)\n",
    "                for pos in start_positions:\n",
    "                    entities.append(\n",
    "                        [\n",
    "                            pos,\n",
    "                            pos+len(ref[\"label\"]),\n",
    "                            ref[\"concept_label\"]\n",
    "                        ]\n",
    "                    )\n",
    "    if entities:\n",
    "        trainer = [\n",
    "            text,\n",
    "            {\n",
    "                \"entities\": entities\n",
    "            }\n",
    "        ]\n",
    "        return trainer, refs_found\n",
    "    else:\n",
    "        return list(), list()\n",
    "\n",
    "    \n",
    "training_data = list()\n",
    "refs_in_data = list()\n",
    "\n",
    "def accumulator(text, reference_sources=None):\n",
    "    training_record, refs_found = train_data(text, reference_vocabulary, reference_sources)\n",
    "    if training_record:\n",
    "        training_data.append(training_record)\n",
    "    if refs_found:\n",
    "        refs_in_data.extend(refs_found) \n",
    "            "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "100%|██████████| 174470/174470 [20:04<00:00, 144.88it/s]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " None,\n",
       " ...]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "Parallel(n_jobs=8, prefer=\"threads\")(\n",
    "    delayed(accumulator)\n",
    "    (\n",
    "        i, reference_sources=['EPA Climate Change Glossary']\n",
    "    ) for i in tqdm(unique_texts)\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "pickle.dump(training_data, open(\"data/ner_trainer_climate_change_terms.p\", \"wb\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
